cf_billing/InformationRegisters/бестПриборыТочекУчетаНП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бестПриборыТочекУчетаНП</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПриборУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектРасчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/InformationRegisters/бестПриборыТочекУчетаНП/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Получает данные прибора учета.
//
// Параметры:
//  Организация		-	СправочникСсылка.Организации.
//  Район			-	СправочникСсылка.энргЗоныОтвественности.
//  Период			-	Дата.
//  ПриборУчета		-	СправочникСсылка.энргПриборыУчетаАбонента.
//  ОбъектРасчета	-	СправочникСсылка.бестОбъектыРасчета.
//  ТочкаУчета		-	СправочникСсылка.энргТочкиУчета.
// 
// Возвращаемое значение:
//   РузультатЗапроса.
//
Функция ПолучитьДанныеПрибораУчета(Организация, Район, Период, ПриборУчета = Неопределено, ОбъектРасчета = Неопределено, ТочкаУчета = Неопределено) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бестПриборыТочекУчетаНП.ТочкаУчета КАК ТочкаУчета,
		|	бестПриборыТочекУчетаНП.ОбъектРасчета КАК ОбъектРасчета,
		|	бестПриборыТочекУчетаНП.ПриборУчета КАК ПриборУчета
		|ИЗ
		|	РегистрСведений.бестПриборыТочекУчетаНП.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И Район = &Район
		|				И ОбъектРасчета = &ОбъектРасчета
		|				И ТочкаУчета = &ТочкаУчета) КАК бестПриборыТочекУчетаНП
		|ГДЕ
		|	бестПриборыТочекУчетаНП.ПриборУчета = &ПриборУчета";
	
	Запрос.УстановитьПараметр("Период", Период);
	Запрос.УстановитьПараметр("Район", Район);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Если ЗначениеЗаполнено(ПриборУчета) Тогда
		Запрос.УстановитьПараметр("ПриборУчета", ПриборУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "бестПриборыТочекУчетаНП.ПриборУчета = &ПриборУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТочкаУчета) Тогда
		Запрос.УстановитьПараметр("ТочкаУчета", ТочкаУчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ТочкаУчета = &ТочкаУчета", "Истина");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОбъектРасчета) Тогда
		Запрос.УстановитьПараметр("ОбъектРасчета", ОбъектРасчета);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ОбъектРасчета = &ОбъектРасчета", "Истина");
	КонецЕсли;
	
	Возврат Запрос.Выполнить();

КонецФункции

#КонецОбласти

#КонецЕсли
